leetcode_2167_minimum_time_to_remove_all_cars_containing_illegal_goods.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2167. Minimum Time to Remove All Cars Containing Illegal Goods</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2167. Minimum Time to Remove All Cars Containing Illegal Goods</h1>
<ul class="org-ul">
<li><a href="mistake_careless_coding.html#ID-461C7633-08C5-468D-9FC3-D78154DDBD42">Mistake: Careless coding</a>.  Came up with the way to count but didn't stop to verify if they were covering all cases.</li>

<li><a href="blackbox_you_solved_a_similar_problem.html#ID-37AF9679-42D1-4A85-9927-2A590268AD87">Blackbox: You solved a similar problem</a> where you had to compute \(dp[i]\) using only the next \(j\) that satisfy some condition.</li>

<li><a href="pattern_find_optimal_partition_of_array.html#ID-4060A2EA-09E8-4E05-922D-8340AAF60F44">Pattern: Find optimal partition of array</a>.  Find \(i\) where \(s[0..i-1]\) will require \(i\) operations plus the best of spending \(N-i\) operation to clear the left side or \(2+best(i+1)\).</li>

<li><a href="how_can_we_extend_the_solution_for_i_to_i_1.html#ID-45B9F3C8-D007-4980-95EF-4361906245A8">How can we extend the solution for \(i\) to \(i+1\)?</a>  The answer will have an interval \((i, j)\) (could be empty) where we will pay \(2\) to remove the cars.   Therefore, it score is \(i-1+ones(i,j)+n-j\).  We can't iterate over all intervals, but can compute the same score if we have \(f(i)\) as the minimum score to remove cars from \(i\) to \(n-1\).  Now the problem is \(min(i + f(i))\) for \(0 \leq i < n\).  Time complexity is \(O(n)\) with \(O(1)\) space.</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">minimumTime</span>(<span style="font-weight: bold;">self</span>, s: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(s)
        <span style="font-weight: bold; font-style: italic;">best</span> = 0
        <span style="font-weight: bold; font-style: italic;">ans</span> = <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"inf"</span>)
        <span style="font-weight: bold; font-style: italic;">j</span> = N - 1
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N - 1, -1, -1):
            <span style="font-weight: bold;">if</span> i == j:
                j -= 1
                <span style="font-weight: bold;">while</span> j &gt;= 0 <span style="font-weight: bold;">and</span> s[j] == <span style="font-style: italic;">"0"</span>:
                    j -= 1
            best = <span style="font-weight: bold;">min</span>(N - i, 2 + best <span style="font-weight: bold;">if</span> s[i] == <span style="font-style: italic;">"1"</span> <span style="font-weight: bold;">else</span> best)
            ans = <span style="font-weight: bold;">min</span>(ans, j + 1 + best)
        <span style="font-weight: bold;">return</span> ans


<span style="font-weight: bold;">assert</span> Solution().minimumTime(<span style="font-style: italic;">"1100101"</span>) == 5
<span style="font-weight: bold;">assert</span> Solution().minimumTime(<span style="font-style: italic;">"0010"</span>) == 2
</pre>
</div>
</div>
</body>
</html>